app/views/principal/index.html.erb


	<%= p "Cantidad usuarios: " + Usuario.all.count.to_s %><br>
	<%= p "Cantidad cuentas: " + TitularCuenta.all.count.to_s %><br>
	<%= p "Cantidad autorizados: " + ActividadAlumno.where("opcion=1 OR opcion=2").count.to_s %><br>
---
SELECT COUNT(*) FROM "usuarios"
SELECT  "titular_cuentas".* FROM "titular_cuentas" WHERE (usuario_id = 9 AND cuenta_id = 13398) ORDER BY "titular_cuentas"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "titular_cuentas"
SELECT  "actividad_alumnos".* FROM "actividad_alumnos" WHERE (alumno_id = 121211 AND actividad_id = 1) ORDER BY "actividad_alumnos"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "actividad_alumnos" WHERE (opcion=1 OR opcion=2)

												    </div>
												    <% @cuenta = CuentaAlumno.where(['alumno_id = ?',t.id]).first rescue nil %>
---
SELECT  "cuenta_alumnos".* FROM "cuenta_alumnos" WHERE (alumno_id = 133982) ORDER BY "cuenta_alumnos"."id" ASC LIMIT $1  [["LIMIT", 1]]