app/controllers/principal_controller.rb

  def index
    @usuario = Usuario.new()
    @actividad = ActividadAlumno.new()

    if usuario_signed_in?
      @alumnos = Alumno.where([
        "id IN (SELECT cuenta_alumnos.alumno_id FROM ( cuentas INNER JOIN titular_cuentas ON cuentas.id=titular_cuentas.cuenta_id ) INNER JOIN cuenta_alumnos ON cuentas.id=cuenta_alumnos.cuenta_id WHERE titular_cuentas.usuario_id=?)" +
        " OR " +
        "id IN (SELECT padre_alumnos.alumno_id FROM padre_alumnos WHERE padre_alumnos.usuario_id=?)",
        current_usuario.id, current_usuario.id]).order(:nombre)
---
SELECT "alumnos".* FROM "alumnos" WHERE (id IN (SELECT cuenta_alumnos.alumno_id FROM ( cuentas INNER JOIN titular_cuentas ON cuentas.id=titular_cuentas.cuenta_id ) INNER JOIN cuenta_alumnos ON cuentas.id=cuenta_alumnos.cuenta_id WHERE titular_cuentas.usuario_id=2) OR id IN (SELECT padre_alumnos.alumno_id FROM padre_alumnos WHERE padre_alumnos.usuario_id=2)) ORDER BY "alumnos"."nombre" ASC

  def autorizar
    p ""
    p params[:actividad_alumno][:alumno_id]
    p params[:actividad_alumno][:opcion]
    p ""
    p ""

    actividad_alumno = ActividadAlumno.where( ["alumno_id = ? AND actividad_id = ?", params[:actividad_alumno][:alumno_id], params[:actividad_alumno][:actividad_id]]).first rescue nil

    if ( actividad_alumno != nil )
      actividad_alumno.opcion = params[:actividad_alumno][:opcion]
      actividad_alumno.save!()
---
SELECT  "actividad_alumnos".* FROM "actividad_alumnos" WHERE (alumno_id = '133982' AND actividad_id = '1') ORDER BY "actividad_alumnos"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "actividad_alumnos" SET "opcion" = $1, "updated_at" = $2 WHERE "actividad_alumnos"."id" = $3  [["opcion", 1], ["updated_at", "2018-04-25 00:46:58.345097"], ["id", 42]]

  def asociar
    if ( !digito(params[:usuario][:cedula].to_i) )
      p "Error en cedula"
      return
    end

    @usuario = Usuario.where( ["cedula = ?", params[:usuario][:cedula]]).first rescue nil
    if ( @usuario != nil )
      password =  Digest::MD5.hexdigest(params[:usuario][:cedula] + DateTime.now.strftime('%Y%m%d%H%M%S'))[0..7]
      p password
      @usuario.update( password: password, password_confirmation: password );
      if ( params[:usuario][:alumno2] == "1")
        TitularCuenta.create(usuario_id: @usuario.id, cuenta_id: params[:usuario][:alumno1].to_i)
      else
        CuentaAlumno.where( ["cuenta_id = ?", params[:usuario][:alumno1].to_i ]).each do |e|
          PadreAlumno.create(usuario_id: @usuario.id, alumno_id: e.alumno_id )
---
SELECT  "usuarios".* FROM "usuarios" WHERE (cedula = '18827664') ORDER BY "usuarios"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "usuarios" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["encrypted_password", "$2a$11$D8kWZ4sdSNXXg1wIFvCtRO37E6KyuQhF6TF/w5KCmyqk0luTrJVV6"], ["updated_at", "2018-04-25 22:17:07.550784"], ["id", 47]]
INSERT INTO "titular_cuentas" ("usuario_id", "cuenta_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usuario_id", 19], ["cuenta_id", 12339], ["created_at", "2018-04-25 23:42:16.209913"], ["updated_at", "2018-04-25 23:42:16.209913"]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 ORDER BY "usuarios"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cuenta_alumnos".* FROM "cuenta_alumnos" WHERE (cuenta_id = 12691)
INSERT INTO "padre_alumnos" ("usuario_id", "alumno_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usuario_id", 47], ["alumno_id", 126911], ["created_at", "2018-04-25 22:17:09.459894"], ["updated_at", "2018-04-25 22:17:09.459894"]]